**** code in process

#+BEGIN_SRC clojure :results silent
(definst someother-fnoise [vol 0.1 ffreq 1000]
  (lpf (* (pink-noise)
          vol)
       ffreq))

(someother-fnoise 0.7)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(someother-fnoise :vol 0.6)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl someother-fnoise :ffreq 500)
#+END_SRC

Use atoms for "hot-swapping" values??!!

#+BEGIN_SRC clojure :results silent
  (def ffl (atom 200))
  (def ffh (atom 8000))

#+END_SRC

#+BEGIN_SRC clojure :results silent

  (on-event [:midi :control-change]
            (fn [{cc-channel :note vel :velocity}]
              (cond (= cc-channel 1) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                    (= cc-channel 2) (ctl someother-fnoise :ffreq (scale-range vel 1 127 @ffl @ffh))
                    (= cc-channel 3) (reset! ffl (* vel 100))
                    (= cc-channel 4) (reset! ffh (* vel 100))
                    ))
            ::someother-pooper)

#+END_SRC

#+BEGIN_SRC clojure :results silent

    (on-event [:midi :control-change]
              (fn [{cc-channel :note vel :velocity}]
                (cond (= cc-channel 1) (do (reset! ffl (/ vel 127 )) 
                                           (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1)))
                      (= cc-channel 2) (do (reset! ffh (* vel 10))
                                           (ctl someother-fnoise :ffreq (scale-range vel 1 127 @ffl @ffh)))
                      ))
              ::someother-pooper-do)

#+END_SRC


#+BEGIN_SRC clojure
(list @ffl @ffh)
#+END_SRC

#+RESULTS:
| 113/127 | 1500 |

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::someother-pooper)
#+END_SRC

#+BEGIN_SRC clojure :results silent
;;; Note this presents problems; why?
(on-event [:midi :control-change]
          (fn [{cc-channel :note vel :velocity}]
            (cond (= cc-channel 1) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 2) (ctl someother-fnoise :ffreq (scale-range vel 1 127 200 8000))
                  (= cc-channel 3) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 4) (ctl someother-fnoise :ffreq (scale-range vel 1 127 (* 200))
                  (= cc-channel 5) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 6) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 7) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 8) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 40) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 41) (ctl someother-fnoise :ffreq   (scale-range vel 1 127 100 1000))
                  ))
          ::someother-pooper)

#+END_SRC
** Polling and running 
#+BEGIN_SRC clojure 
(run (poll:kr (impulse:kr 10) (abs  (* 1000 (pink-noise:kr))) "polled-val:"))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 112>

#+BEGIN_SRC clojure :results silent
(run (poll:kr (impulse:kr 10) (* 1000 (sin-osc:kr)) "polled-val:"))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(run 20 (poll:kr (impulse:kr 5) (line:kr 0.0 10.0 20)) "polled-val:"))
#+END_SRC

** give oscillators UGens arguments meaningful in Hz (i.e. be aware of 'mul' and 'add')
#+BEGIN_SRC clojure
(demo 10 (sin-osc (abs  (* 10000 (brown-noise:kr)))))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 59>

#+BEGIN_SRC clojure
(demo 10 (sin-osc (abs  (+ 300 (* 1000 (pink-noise:kr))))))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 60>
** misc. manipulations with slow-grain-reverb
#+BEGIN_SRC clojure
(ctl slow-grain-reverb :trigger-rate 0.5 :centerpos 4 :grain-dur 1)
#+END_SRC

#+RESULTS:
: #overtone.studio.inst.Inst{:name "slow-grain-reverb", :params ({:name "b", :default 0.0, :rate :kr, :value #atom[0.0 0x67ef0a06]} {:name "trigger-rate", :default 1.0, :rate :kr, :value #atom[1.0 0x38a4d81d]} {:name "centerpos", :default 1.0, :rate :kr, :value #atom[1.0 0x60e21590]} {:name "grain-dur", :default 0.5, :rate :kr, :value #atom[0.5 0x1702c902]}), :args ("b" "trigger-rate" "centerpos" "grain-dur"), :sdef {:name "user/slow-grain-reverb", :constants [0.0 2.0 1.0 17.0 0.9 0.2 0.1], :params (0.0 1.0 1.0 0.5), :pnames ({:name "b", :index 0} {:name "trigger-rate", :index 1} {:name "centerpos", :index 2} {:name "grain-dur", :index 3}), :ugens ({:args nil, :special 0, :name "Control", :rate 1, :inputs (), :rate-name :kr, :n-outputs 4, :id 306, :outputs ({:rate 1} {:rate 1} {:rate 1} {:rate 1}), :n-inputs 0} #<sc-ugen: impulse:ar [1]> #<sc-ugen: t-grains:ar [5]> #<sc-ugen: free-verb:ar [6]> #<sc-ugen: out:ar [7]>)}, :group #<synth-group[live]: Inst slow-grain-reverb Container 40>, :instance-group #<synth-group[live]: Inst slow-grain-reverb 41>, :fx-group #<synth-group[live]: Inst slow-grain-reverb FX 42>, :mixer #<synth-node[live]: overtone.stu547/mono-inst-mixer 43>, :bus #<audio-bus: No Name, mono, id 17>, :fx-chain [], :volume #atom[1.0 0x16d81be7], :pan #atom[0.0 0x6666c239], :n-chans 1}

#+BEGIN_SRC clojure :results silent
(ctl slow-grain-reverb :trigger-rate 0.3 :centerpos (tenth-inc 0.4) :grain-dur 2)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def nome (metronome 60))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl slow-grain-reverb :trigger-rate 0.3 :centerpos (* (nome) 0.5) :grain-dur 2)
#+END_SRC


#+BEGIN_SRC clojure :results silent
(slow-grain-reverb)
#+END_SRC
** general-tgrains with t-randomness
#+BEGIN_SRC clojure
  (defsynth general-trand-synth
    "stochastic granular synthesis abstraction (in stereo!)"
    [buffer 0 trate 1 dur-numerator 12 amp 0.8 centerpos 0]
    (let [trate trate
          dur (/ dur-numerator trate)
          clk (impulse:kr trate)
          centerpos (+ centerpos (t-rand:kr 0 0.01 clk))]
      (out 0 (pan2 
              (t-grains:ar 1      ;; num of channels in the output?
                           clk    ;; aka 'trigger-rate'
                           buffer ;; number of buffer passed in
                           1      ;; playback "speed" of grain
                           centerpos ;;
                           dur    ;; length of grain
                           0      ;; pan
                           amp    ;; amplitude
                           2      ;; interpolation type
                           )))))
#+END_SRC

#+RESULTS:
: #<synth: general-trand-synth>

#+BEGIN_SRC clojure
(general-trand-synth 0)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/general-trand-synth 98>

** mono defsynth out
#+BEGIN_SRC clojure
  (defsynth test [freq 440 amp 0.1]
    (out 0 (* amp (sin-osc freq))))

  (test)
#+END_SRC

#+RESULTS:
: #<synth: test>#<synth-node[loading]: user/test 89>

#+BEGIN_SRC clojure
  (defsynth test-pan [freq 440 amp 0.1]
    (out 0 (pan2 (* amp (sin-osc freq)))))

  (test-pan)
#+END_SRC

#+RESULTS:
: #<synth: test-pan>#<synth-node[loading]: user/test-pan 90>


#+BEGIN_SRC clojure
  (defsynth test-pan2 [freq1 440 freq1-pan -0.5 freq2 443 freq2-pan 0.5 amp 0.1]
    (out 0 (pan2 (* amp (sin-osc freq1)) freq1-pan 0.5))
    (out 1 (pan2 (* amp (saw freq2)) freq2-pan 0.5))
    )

  (test-pan2)
#+END_SRC

#+RESULTS:
: #<synth: test-pan2>#<synth-node[loading]: user/test-pan2 94>
** use line:kr to move through centerpos
:PROPERTIES:
:ID:       326223F4-AA19-4058-A07C-3E5F5DB9AFF5
:END:

#+BEGIN_SRC clojure
(def gold (general-tgrains-synth :buffer 0 :centerpos (line:kr 0.0 100 30)))
#+END_SRC

#+RESULTS:
: #'user/gold

#+BEGIN_SRC clojure
  (defsynth tgrains-line-synth [buffer 0 trate 1 dur-numerator 8 amp 0.8 centerpos 0]
    (out 0 (pan2 
            (let [track-len (buf-dur:kr buffer)
                  trate trate
                  dur (/ dur-numerator trate)
                  clk (impulse:ar trate)
                  centerpos (line:kr centerpos track-len (* 2 track-len))  ]
              (t-grains:ar 1
                           clk
                           buffer
                           1
                           centerpos
                           dur
                           0
                           amp
                           2)))))
#+END_SRC

#+RESULTS:
: #<synth: tgrains-line-synth>


Plays almost exactly like regular track
#+BEGIN_SRC clojure
(def gold-line (tgrains-line-synth))
#+END_SRC

#+RESULTS:
: #'user/gold-line

#+BEGIN_SRC clojure
(def yanc-line (tgrains-line-synth :buffer 1))
#+END_SRC

#+RESULTS:
: #'user/yanc-line
** simple example over =demo=
Note that this works, but if we try to pass a "duration" argument to
=demo=...
#+BEGIN_SRC clojure
(defn test
  [freq]
  (demo (sin-osc freq)))
#+END_SRC

#+RESULTS:
: #'overtone.examples.buses.getonthebus/test

...Clojure complains:

#+BEGIN_SRC clojure
(defn test1
  [dur]
  (demo dur (sin-osc)))
#+END_SRC

#+RESULTS:

However, using a macro...

#+BEGIN_SRC clojure
(defmacro my-demo
  [dur]
  `(demo ~dur (sin-osc)))
#+END_SRC

#+RESULTS:
: #'overtone.examples.buses.getonthebus/my-demo

#+BEGIN_SRC clojure
(my-demo 0.1)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: overtone.exam736/audition-synth 212>
** pass in ugens to demo

#+BEGIN_SRC clojure
(defmacro my-ugen-demo
  [dur ugen]
  `(demo ~dur (~ugen)))
#+END_SRC

#+RESULTS:
: #'user/my-ugen-demo

See examples of usage below
** the four waveforms (a la Nonesuch Guide to Electronic Music)

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 sin-osc)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 saw)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 lf-tri)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 pulse)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (pulse 440 0.1))
#+END_SRC

#+BEGIN_SRC clojure
(demo 4 (pulse 440 0.9))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 277>

#+BEGIN_SRC clojure :results silent
(demo 4 (pulse 440 0.5))

;; square being a special case of pulse/rectangular
(my-ugen-demo 5 square)
#+END_SRC





#+BEGIN_SRC clojure :results silent
(my-ugen-demo 0.1 blip)
#+END_SRC
** use randomness
#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ (weighted-choose [10 400] [0.1 0.9])  (* (weighted-choose [10 400] [0.1 0.9]) (pink-noise)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
  (let [hz  (choose (take 5 (reverse (map #(* % 100) (range 10)))))]
    (demo 2 (sin-osc (+ hz (* 400 (pink-noise))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (brown-noise)))))
#+END_SRC


#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-noise0 10)))))
#+END_SRC


#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-noise1 10)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-noise2 10)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-brown-noise0 10)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-clip-noise 10)))))
#+END_SRC

#+BEGIN_SRC clojure
(demo 4 (sin-osc (+ 350 (* (* 100 (lf-brown-noise0:kr 5)) (lf-clip-noise 4)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 10 (sin-osc (* 0.5 (+ (* 900 (lf-brown-noise0:kr 20)) (* (* 100 (lf-brown-noise0:kr 1)) (lf-clip-noise 2))))))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 338>


#+RESULTS:
: #<synth-node[loading]: user/audition-synth 338>

** use 'repeatedly' to approximate sclang expansions
#+BEGIN_SRC clojure :results silent
(demo (mix (repeatedly 10 #(sin-osc (+ 200 (rand-int 999))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo (mix [(sin-osc 220) (sin-osc 420)]))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(dotimes [n 2] (demo (sin-osc (+ 200 (rand-int 999)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(dotimes [n 2] (demo (sin-osc (+ 200 (rand-int 999)))))
#+END_SRC

#+BEGIN_SRC clojure
  (definst clang [note 60 amp 0.3]
    (let [freq (midicps note)]
      (* amp
         (mix (repeatedly 5 #(sin-osc (+ 200 (rand-int 999)))))
         (env-gen (lin 0.01 1 1 1) 1 1 0 1 FREE))))
#+END_SRC

#+RESULTS:
: #<instrument: clang>

#+BEGIN_SRC clojure :results silent
(clang)
#+END_SRC


#+BEGIN_SRC clojure
  (defsynth clang1 []
      (out 0 (mix (repeatedly 10 #(sin-osc (+ 200 (rand-int 999)))))))
#+END_SRC

#+RESULTS:
: #<synth: clang1>

#+BEGIN_SRC clojure :results silent
(clang1)
#+END_SRC

** develop macro and event handler to for random synth player
#+BEGIN_SRC clojure
(defmacro play-rand []
`(demo 0.4 (mix (repeatedly 10 #(sin-osc (+ 200 (rand-int 999)))))))
#+END_SRC

#+RESULTS:
: #'sc-one/play-rand

#+BEGIN_SRC clojure :results silent
(play-rand)
#+END_SRC

#+BEGIN_SRC clojure
(defmacro play-rand2 [amp]
`(demo 0.4       (* amp
         (mix (repeatedly 5 #(sin-osc (+ 200 (rand-int 999)))))
         (env-gen (lin 0.01 1 1 1) 1 1 0 1 FREE))))
#+END_SRC

#+RESULTS:
: #'sc-one/play-rand2

#+BEGIN_SRC clojure
(play-rand2)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 10 (* (env-gen (lin 0 1 1 1 1) 1 1 0 1 FREE) (repeatedly 5 #(sin-osc (+ 200 (rand-int 999))))))
#+END_SRC

#+BEGIN_SRC clojure
(defmacro play-rand2 []
`(demo 10 (* (env-gen (lin 0 1 1 1 1) 1 1 0 1 FREE) (repeatedly 5 #(sin-osc (+ 200 (rand-int 999)))))))
#+END_SRC
#+RESULTS:
: #'user/play-rand2

#+BEGIN_SRC clojure :results silent
(play-rand2)
#+END_SRC

#+BEGIN_SRC clojure
(defmacro play-rand3 [dur]
`(demo ~dur (repeatedly 5 #(sin-osc (+ 200 (rand-int 999))))))
#+END_SRC
#+RESULTS:
: #'user/play-rand3

#+BEGIN_SRC clojure
(play-rand3 0.1)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 38>


#+BEGIN_SRC clojure
(defmacro play-rand4 [dur hz]
`(demo ~dur (repeatedly 5 #(sin-osc (+ ~hz (rand-int 999))))))
#+END_SRC

#+RESULTS:
: #'user/play-rand4

#+BEGIN_SRC clojure
(play-rand4 0.2 300)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 53>

#+BEGIN_SRC clojure
(on-event [:midi :note-on]
(fn [e] (play-rand4 0.2 300))
::rand-handler)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure
(remove-event-handler ::rand-handler)
#+END_SRC
